import requests
import time
import os

# Ссылка на RAW файл на твоем GitHub, где лежит просто цифра 0 или 1
# Например: https://raw.githubusercontent.com/твой_ник/pando/main/trigger.txt
CONTROL_URL = "ТВОЯ_ССЫЛКА_НА_RAW_FILE"

def run_troll():
    # Очищаем экран и ставим кодировку для Windows
    if os.name == 'nt':
        os.system('chcp 65001 > nul')
        os.system('cls')
    else:
        os.system('clear')

    logo = r'''
⣿⣿⣿⠟⠛⠛⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⢋⣩⣉⢻⣿⣿
⣿⣿⣿⠀⣿⣶⣕⣈⠹⠿⠿⠿⠿⠟⠛⣛⢋⣰⠣⣿⣿⠀⣿⣿
⣿⣿⣿⡀⣿⣿⣿⣧⢻⣿⣶⣷⣿⣿⣿⣿⣿⣿⠿⠶⡝⠀⣿⣿
⣿⣿⣿⣷⠘⣿⣿⣿⢏⣿⣿⣋⣀⣈⣻⣿⣿⣷⣤⣤⣿⡐⢿⣿
⣿⣿⣿⣿⣆⢩⣝⣫⣾⣿⣿⣿⣿⡟⠿⠿⠦⠀⠸⠿⣻⣿⡄⢻
⣿⣿⣿⣿⣿⡄⢻⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣾⣿⣿⣿⣿⠇⣼
⣿⣿⣿⣿⣿⣿⡄⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣰⣿
⣿⣿⣿⣿⣿⣿⠇⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢀⣿⣿
⣿⣿⣿⣿⣿⠏⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿
⣿⣿⣿⣿⠟⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⣿⣿
⣿⣿⣿⠋⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⣿⣿
⣿⣿⠋⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⢸⣿
⣿⠏⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡯⢸⣿
⡏⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⢸⣿
    '''
    print('\033[92m' + logo + '\033[0m') # Зеленый логотип
    print("\n[ СИСТЕМНОЕ УВЕДОМЛЕНИЕ ]")
    print("Привет, от Дарын, если все норм выйдет")
   
while True:
    try:
        # Проверяем файл на GitHub
        r = requests.get(CONTROL_URL)
        if r.text.strip() == "1":
            run_troll()
            break # После показа выходим, чтобы не бесить
    except:
        pass # Если нет инета, просто молчим
    
    time.sleep(60) # Спим 60 секунд, чтобы не грузить систему
